scoring = {"яблочко": 50, "Зеленое кольцо": 25,
           "Внешнее кольцо": {1:8, 2:6, 3: 21, 4: 8, 5: 13, 6: 27,7: 12, 8:18, 9: 31, 10: 20, 11: 45, 12: 37,
                              13: 25, 14: 54, 15: 87, 16: 34, 17: 21, 18: 73, 19: 20, 20: 39},
           "Внутреннее кольцо": {1: 2, 2: 5, 3: 8, 4: 23, 5: 12, 6: 42, 7: 63, 8: 21, 9: 33, 10: 12, 11: 62, 12: 34,
                                 13: 23, 14: 52, 15: 20, 16: 30, 17: 78, 18:65, 19: 34, 20: 76}}


def score(place, point=False):
    if not point:
        return scoring.get(place)
    return scoring.get(place).get(point)

print(score("яблочко"))
print(score("Внешнее кольцо", 8))
print(score("Внутреннее кольцо", 18))
