def number_to_words(n):
    n = str()
    a = ["один", "два", "три", "четыре", "пять", "шесть", "семь",
         "восемь", "девять"]
    b = ["двадцать", "тридцать", "сорок", "пятьдесят", "шестдесят", "семьдесят", "восемдесят", "девяносто",
         "восемнадцать", "девятнадцать"]
    c = ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать",
    "семнадцать", "восемнадцать", "девятнадцать"]
    if 10 <= int(n) <= 19:
        return c[int(n[-1])]
    else:
        if len(str(n)) == 1:
            return a[int(n[0]) - 1]
        else:
            if int(n[-1]) == 0:
                return b[int(n[0]) - 2]
            return "".join(b[int(n[0]) - 2] + a[int(n[-1]) - 1])


print(number_to_words(13))
